app/views/projects/show.html.erb


    <% @project.groups.each do |group| %>
---
SELECT "groups".* FROM "groups"  WHERE "groups"."project_id" = $1

        <ul class='ruled'>
          <% group.scenarios.each do |scenario| %>
---
SELECT "scenarios".* FROM "scenarios"  WHERE "scenarios"."group_id" = $1

    <ul class="ruled">
      <% @project.deployments.current.each do |deployment| %>
---
SELECT "deployments".* FROM "deployments"  WHERE "deployments"."project_id" = $1 AND (completed != 't')  ORDER BY created_at DESC  [["project_id", 4]]

    <ul class="ruled">
      <% @project.deployments.completed.each do |deployment| %>
---
SELECT "deployments".* FROM "deployments"  WHERE "deployments"."project_id" = $1 AND (("deployments"."completed" = 'f' OR "deployments"."completed" IS NULL))  ORDER BY created_at DESC  [["project_id", 4]]