app/views/scenarios/show.html.erb

<p id="notice"><%= notice %></p>
<%= link_to 'Back to Project', @scenario.group.project %>
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1