app/controllers/deployments_controller.rb

  def show
    @task_groups = @deployment.tasks.includes(:scenario).order('scenarios.priority ASC, LOWER(name) ASC').group_by {|t| t.group_id}
---
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."deployment_id" = $1  ORDER BY created_at ASC  [["deployment_id", 8]]

  def create
    @deployment = Deployment.new(deployment_params)
    @deployment.user_id = current_user.id

    respond_to do |format|
      if @deployment.save
---
INSERT INTO "deployments" ("created_at", "name", "project_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-04-28 05:49:49.204331"], ["name", "The first deployment ever"], ["project_id", 4], ["updated_at", "2014-04-28 05:49:49.204331"], ["user_id", 2]]

    def set_deployment
      @deployment = Deployment.find(params[:id])
---
SELECT  "deployments".* FROM "deployments"  WHERE "deployments"."id" = $1 LIMIT 1  [["id", 8]]