app/controllers/groups_controller.rb

INSERT INTO "groups" ("created_at", "name", "project_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-04-28 01:42:59.934491"], ["name", "Filmmaker Application"], ["project_id", 3], ["updated_at", "2014-04-28 01:42:59.934491"], ["user_id", 2]]
---
  def create
    @group = Group.new(group_params)
    @group.user_id = current_user.id
    respond_to do |format|
      if @group.save

UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = 3  [["name", "Accounts"], ["updated_at", "2014-04-28 04:07:52.631384"]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)