app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.user_id = current_user.id

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-04-28 00:48:48.728884"], ["description", "asfasfasf"], ["name", "ljkfasfasf"], ["updated_at", "2014-04-28 00:48:48.728884"], ["user_id", 2]]