app/controllers/scenarios_controller.rb

SELECT "scenarios".* FROM "scenarios"
---
  def index
    @scenarios = Scenario.all

INSERT INTO "scenarios" ("created_at", "expected", "group_id", "name", "notes", "priority", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
---
  def create
    @scenario = Scenario.new(scenario_params)
    @scenario.user_id = current_user.id

    respond_to do |format|
      if @scenario.save
        @scenario.sync_deployments
        format.html { redirect_to edit_project_path(@scenario.group.project), notice: 'Scenario was successfully created.' }

UPDATE "scenarios" SET "name" = $1, "notes" = $2, "updated_at" = $3 WHERE "scenarios"."id" = 3
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
---
  def update
    respond_to do |format|
      if @scenario.update(scenario_params)
        format.html { redirect_to edit_project_path(@scenario.group.project), notice: 'Scenario was successfully updated.' }

SELECT  "scenarios".* FROM "scenarios"  WHERE "scenarios"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_scenario
      @scenario = Scenario.find(params[:id])