app/controllers/tasks_controller.rb

UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = 13  [["completed", "f"], ["updated_at", "2014-04-30 03:29:28.116599"]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)